Hi there,

I'm facing same issue.

This is what terraform creates when using multiple provisioning:

```
Terraform will perform the following actions:

  # phpipam_address.address[0] will be created
  + resource "phpipam_address" "address" {
      + address_id           = (known after apply)
      + description          = "Managed by Terraform"
      + device_id            = (known after apply)
      + edit_date            = (known after apply)
      + exclude_ping         = (known after apply)
      + hostname             = "transacional-core-1.mydomain.comr"
      + id                   = (known after apply)
      + ip_address           = "10.10.1.1"
      + is_gateway           = (known after apply)
      + last_seen            = (known after apply)
      + mac_address          = (known after apply)
      + note                 = (known after apply)
      + owner                = (known after apply)
      + ptr_record_id        = (known after apply)
      + remove_dns_on_delete = true
      + skip_ptr_record      = (known after apply)
      + state_tag_id         = (known after apply)
      + subnet_id            = 63
      + switch_port_label    = (known after apply)
    }

  # phpipam_address.address[1] will be created
  + resource "phpipam_address" "address" {
      + address_id           = (known after apply)
      + description          = "Managed by Terraform"
      + device_id            = (known after apply)
      + edit_date            = (known after apply)
      + exclude_ping         = (known after apply)
      + hostname             = "transacional-core-2.mydomain.comr"
      + id                   = (known after apply)
      + ip_address           = "10.10.1.1"
      + is_gateway           = (known after apply)
      + last_seen            = (known after apply)
      + mac_address          = (known after apply)
      + note                 = (known after apply)
      + owner                = (known after apply)
      + ptr_record_id        = (known after apply)
      + remove_dns_on_delete = true
      + skip_ptr_record      = (known after apply)
      + state_tag_id         = (known after apply)
      + subnet_id            = 63
      + switch_port_label    = (known after apply)
    }

  # phpipam_address.address[2] will be created
  + resource "phpipam_address" "address" {
      + address_id           = (known after apply)
      + description          = "Managed by Terraform"
      + device_id            = (known after apply)
      + edit_date            = (known after apply)
      + exclude_ping         = (known after apply)
      + hostname             = "transacional-core-3.mydomain.comr"
      + id                   = (known after apply)
      + ip_address           = "10.10.1.1"
      + is_gateway           = (known after apply)
      + last_seen            = (known after apply)
      + mac_address          = (known after apply)
      + note                 = (known after apply)
      + owner                = (known after apply)
      + ptr_record_id        = (known after apply)
      + remove_dns_on_delete = true
      + skip_ptr_record      = (known after apply)
      + state_tag_id         = (known after apply)
      + subnet_id            = 63
      + switch_port_label    = (known after apply)
    }
```

Then when creating:

```
vsphere_folder.folder: Creating...
phpipam_address.address[1]: Creating...
phpipam_address.address[1]: Creation complete after 1s [id=6566]
phpipam_address.address[0]: Creating...
phpipam_address.address[2]: Creating...

Error: Error from API (409): IP address already exists

  on main.tf line 15, in resource "phpipam_address" "address":
  15: resource "phpipam_address" "address" {

Error: Error from API (409): IP address already exists

  on main.tf line 15, in resource "phpipam_address" "address":
  15: resource "phpipam_address" "address" {

Error: error creating folder: ServerFaultCode: The name 'TRANSACIONAL-CORE' already exists.

  on main.tf line 60, in resource "vsphere_folder" "folder":
  60: resource "vsphere_folder" "folder" {
```

My resource config:
```
resource "phpipam_address" "address" {
  count       = var.vm_count
  subnet_id   = data.phpipam_subnet.subnet.subnet_id
  ip_address  = data.phpipam_first_free_address.next_address.ip_address
  hostname    = "transacional-core-${count.index+1}.mydomain.com"
  description = "Managed by Terraform"


  lifecycle {
    ignore_changes = [
      subnet_id
    ]
  }
}
```

And my vsphere resource:

```
resource "vsphere_virtual_machine" "cloned_virtual_machine" {
  count            = var.vm_count
  name             = "${var.vsphere_virtual_machine_name} ${count.index+1}"
  resource_pool_id = data.vsphere_resource_pool.pool.id
  datastore_id     = data.vsphere_datastore.datastore.id
  folder           = var.vsphere_folder
  depends_on  = [phpipam_address.address]

  num_cpus = 1
  memory   = 2048

  guest_id = data.vsphere_virtual_machine.template.guest_id

  scsi_type = data.vsphere_virtual_machine.template.scsi_type

  network_interface {
    network_id   = data.vsphere_network.network.id
    adapter_type = data.vsphere_virtual_machine.template.network_interface_types[0]
  }

  disk {
    label = "disk0"
    size = data.vsphere_virtual_machine.template.disks.0.size
  }

  clone {
    template_uuid = data.vsphere_virtual_machine.template.id
    customize {
      linux_options {
        host_name = "${var.vsphere_virtual_machine_name} ${count.index+1}"
        domain = "mydomain.com"
      }

      network_interface {
        ipv4_address = data.phpipam_first_free_address.next_address.ip_address
        ipv4_netmask = 24
      }

      dns_suffix_list = ["mydomain.com"]
      dns_server_list = ["8.8.8.8"]
      ipv4_gateway = "10.10.1.1"
    }
  }
}
```

Am I missing something here?

Best regards,
Rafael